---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductDataRange
source: html/54b6f23a-2e99-78ad-daa9-5516bb59cf25.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductDataRange Property

The product data range of the fabrication part.

## Syntax (C#)
```csharp
public string ProductDataRange { get; }
```